{
	"layout": {
		"navbar": {
			"navigation": {
				"documentation": {
					"title": "Documentation",
					"routes": {
						"commands": {
							"title": "Commands",
							"description": "View some of the most popular and important commands in Ticketer."
						},
						"self-hosting": {
							"title": "Self-Hosting",
							"description": "Learn how to self-host the Ticketer bot on any computer that supports Docker."
						},
						"development": {
							"title": "Development",
							"description": "Instructions on how to develop Ticketer."
						},
						"contributing-to-localisation": {
							"title": "Contributing to Localisation",
							"description": "Instructions on how to add language translations in Ticketer."
						}
					}
				},
				"legal": {
					"title": "Legal",
					"routes": {
						"privacy-policy": {
							"title": "Privacy Policy",
							"description": "Read the privacy policy for Ticketer."
						},
						"terms-of-service": {
							"title": "Terms of Service",
							"description": "Read the terms of service for Ticketer."
						}
					}
				}
			},
			"items": {
				"sidebar": "Links & Theme",
				"invite": "Invite to Discord Server",
				"support": "Discord Support Server",
				"github": "GitHub Repository",
				"theme": {
					"toggle": {
						"light": "Light",
						"dark": "Dark",
						"system": "System"
					},
					"change": "Change Theme"
				},
				"locale": {
					"toggle": {
						"en-GB": "English (Great Britain)",
						"en-US": "English (United States)",
						"sv-SE": "Swedish (Sweden)"
					},
					"change": "Change Language"
				}
			}
		},
		"footer": {
			"license": "Released under the Apache-2.0 License.",
			"copyright": "Copyright © Ticketer"
		}
	},
	"components": {
		"codeblock": {
			"copied": "Copied to clipboard!",
			"copy": "Copy"
		}
	},
	"pages": {
		"index": {
			"metadata": {
				"title": "Homepage",
				"description": "The Discord bot for creating tickets with threads."
			},
			"heading": {
				"1": "Your Discord bot for",
				"2": "tickets with threads"
			},
			"button": "Invite to your Discord Server"
		},
		"docs": {
			"commands": {
				"heading": {
					"title": "Ticketer Commands",
					"description": "Read about some of the important commands in Ticketer as a moderator or user of the bot!"
				},
				"content": {
					"thread-tickets": {
						"title": "Thread Tickets",
						"description": "The main focus of the bot is on threads which act as tickets. There are several parts to this feature which may seem daunting at first, but play out well in practice.",
						"sections": {
							"configuring-thread-tickets": {
								"title": "Configuring Thread Tickets",
								"paragraphs": {
									"1": "To get started with thread tickets as a moderator, run the subcommands under the subcommand group <i>/configuration-ticket-threads global-settings</i>. There is currently only one configuration to set: the amount of active tickets a user may have globally at once.",
									"2": "Afterwards, you can create a category with an emoji (optional), title, and description using the command below.",
									"3": "You then need to choose the \"ticket managers\" who are responsible for the category, as well as the text channel where these tickets go. These settings, including more, can be found using the subcommand below:"
								},
								"imageAlts": {
									"1": "Picture of the ticket threads edit select menu."
								}
							},
							"creating-a-ticket": {
								"title": "Creating a Ticket",
								"paragraphs": {
									"1": "To create a ticket, use the command below:",
									"2": "An example of a ticket looks like the following picture:"
								},
								"imageAlts": {
									"1": "Picture of a new thread ticket."
								},
								"commands": {
									"1": "ticket"
								}
							},
							"creating-a-panel": {
								"title": "Creating a Panel",
								"paragraphs": {
									"1": "If you want to create a panel where users can click on a button to create a ticket, use the command below. You can also edit the title and description of the embed."
								},
								"imageAlts": {
									"1": "Picture of the ticket threads panel."
								}
							},
							"ticket-actions": {
								"title": "Ticket Actions",
								"paragraphs": {
									"1": "There are multiple actions you can do on a ticket. This includes renaming the title, locking the thread, closing the thread, locking and closing the thread, and finally deleting the ticket. As a ticket author or manager, you can run these actions either through the commands or the buttons in the original ticket message."
								}
							}
						}
					},
					"user-forums": {
						"title": "User Forums",
						"description": "In addition to thread tickets, Ticketer provides a way to send a message everytime a new thread in a specified forum is created. The subcommand to create a new user forum configuration goes as follows:",
						"imageAlt": "Picture of the user forums thread message."
					},
					"automatic-threads": {
						"title": "Automatic Threads",
						"description": "Similar to user forums, Ticketer can create a thread under a new message sent in a specified text channel. The subcommand below can be used to create a new configuration for automatic threads.",
						"imageAlt": "Picture of the automatic threads message and thread."
					},
					"miscellaneous": {
						"title": "Miscellaneous",
						"description": "A popular command for server moderators is the common purge command:",
						"command": "purge"
					}
				}
			},
			"self-hosting": {
				"heading": {
					"title": "Self-Hosting Ticketer",
					"description": "Looking to host the Ticketer bot on your own machine or server? The only required software to do so is <linkDocker>Docker Engine</linkDocker>. Need help? Join the <linkSupport>Ticketer support server</linkSupport>! This tutorial assumes you are running Linux to self-host the bot but any other operating system should work fine as well."
				},
				"content": {
					"creating-the-compose-file": {
						"title": "Creating the Compose File",
						"paragraphs": {
							"1": "Create a directory/folder with any name (like \"Ticketer\") and then create a file in that directory named \"compose.yaml\".",
							"2": "Copy and paste the following content in the created file:"
						}
					},
					"environment-variables": {
						"title": "Environment Variables",
						"paragraphs": {
							"1": "You will need the credentials to the Discord bot/application. If you have not already, create a new <linkDiscordApplication>Discord application</linkDiscordApplication> (enable the \"Server Members\" intent!) and edit the following variables with the appropriate credentials in a new file named \"<i>.env.bot.production.local</i>\". The variable <i>DISCORD_GUILD_ID</i> is the server (ID) where private commands are used. Put the details inside the quotation marks for the variables that have them!",
							"2": "The database also requires a few credentials to run. Create a file named \"<i>.env.database.production.local</i>\" and then create some login credentials with the following template below. You can change every variable to have whatever value you want except for <i>DB_HOST</i>."
						}
					},
					"running-the-bot": {
						"title": "Running the Bot",
						"paragraphs": {
							"1": "Now it is time to run the bot! Run the following command to start the database and bot (this may take some time):",
							"2": "To deploy the application commands of the bot, run the following line:",
							"3": "Once the commands have been deployed, run the <i>/migrate</i> command in Discord to deploy any database changes that may be needed:",
							"4": "If you want to stop the database and bot, run the commands below:"
						},
						"command": "migrate"
					},
					"accessing-the-database": {
						"title": "Accessing The Database",
						"description": "If you want to access the database, you can do so by running the two commands below and replacing \"<i>USERNAME</i>\" with the username you chose in the environment variable:"
					}
				}
			},
			"development": {
				"title": "Develop Ticketer",
				"paragraphs": {
					"1": "This page describes how to launch a <linkVSCode>Visual Studio Code</linkVSCode> session using <linkDevContainers>Dev Containers</linkDevContainers> to edit the code in Ticketer.",
					"2": "The software which you will need installed is <linkDockerDesktop>Docker Desktop</linkDockerDesktop>. <linkDockerEngine>Docker Engine</linkDockerEngine> should also work fine if you do not want to use Docker Desktop.",
					"3": "You will also need the Dev Containers extension installed in Visual Studio Code."
				},
				"sections": {
					"setting-up": {
						"title": "Setting Up",
						"paragraphs": {
							"1": "Open Visual Studio Code, and inside the code editor, open the command palette and run the following command.",
							"2": "It should prompt for a repository URL. Paste Ticketer's GitHub URL and afterwards choose the main branch:",
							"3": "Once the Dev Container has started, you can get to coding. It's as simple as that! Do not forget to create the necessary bot development environment file to run the bot!"
						}
					}
				}
			},
			"contributing-to-localisation": {
				"title": "Contributing to Localisation",
				"description": "Since version 3, the Ticketer bot supports localisation depending on both the user's and server's locale. We welcome all localisation contributions! This page will explain how to add localisation files to the both the bot and website. This tutorial assumes you are using <linkVSCode>Visual Studio Code</linkVSCode> to edit the files.",
				"sections": {
					"prerequisites-before-contributing": {
						"title": "Prerequisites Before Contributing",
						"description": "This tutorial assumes you have knowledge of Git and creating pull requests if you wish to merge the changes into the Ticketer codebase, as well as having already configured the codebase to run. If you are looking to contribute to this project and do not have those skills yet, it is time to learn some basic Git and GitHub!"
					},
					"what-locales-can-be-supported": {
						"title": "What locales can be supported?",
						"description": "The locales that can be supported in the bot are found in the <linkDiscordReference>Discord Developers Documentation Reference</linkDiscordReference>. The website should preferably have the same range of locales as the bot, but it does not need to."
					},
					"getting-started-bot": {
						"title": "Getting Started (Bot)",
						"paragraphs": {
							"1": "To create a new locale, create a folder in the <i>/apps/bot/src/i18n</i> directory, with the folder name as one of the locales from the locale list, e.g. \"fr\". Next, to make the process easier, copy each file from the \"sv-SE\" folder and paste them into your new localisation folder. The folder should look something like this afterwards:",
							"2": "Then, you should run the \"i18n\" NPM script on the bottom left of your explorer. This will generate the types required, as well as type checking the files for any missing or invalid localisations.",
							"3": "Finally, you can start editing the files and add the correct translations for your locale of choice! If you need a reference for the translation, you can open the British English file variant and translate accordingly. Happy translating!"
						},
						"imageAlts": {
							"1": "Picture of an example localisation folder.",
							"2": "Picture of the i18n NPM script."
						}
					},
					"getting-started-website": {
						"title": "Getting Started (Website)",
						"description": "Getting started with translating the website is easier, just add your locale of choice in the <i>locales</i> array in <i>/apps/website/src/i18n/routing.ts</i>. Afterwards, create a file with the same naming convention as the other files in the languages folder but with your chosen locale. You can copy and paste the content of <i>sv-SE.json</i> (or the English version) just like in the bot version. To see your translations, run the \"dev\" NPM script and open the link."
					}
				}
			}
		},
		"legal": {
			"privacy-policy": {
				"heading": {
					"title": "Ticketer Privacy Policy",
					"description": "This page was last updated on {lastUpdated}."
				},
				"sections": {
					"website": {
						"title": "Website",
						"sections": {
							"1": {
								"title": "What user information is collected?",
								"description": "The anonymous user information collected by the Ticketer website is the following:",
								"list": {
									"1": "Geolocation",
									"2": "Device OS & Version",
									"3": "Browser & Version",
									"4": "Device Type"
								}
							},
							"2": {
								"title": "How is the user information collected?",
								"description": "According to <linkVercelWebAnalytics>Vercel Web Analytics</linkVercelWebAnalytics>, the visitors are identified by a hash created from the incoming request. Cookies are not used to track users. Page views are tracked through the native Browser API."
							},
							"3": {
								"title": "How is the personal information used?",
								"description": "The data collected is used for analytical purposes and may be used to improve the user experience."
							},
							"4": {
								"title": "Is the personal information shared?",
								"description": "This information is sent to <linkVercel>Vercel</linkVercel> to provide the analytical data."
							},
							"5": {
								"title": "How can I contact for questions or concerns?",
								"description": "You may join the official <linkSupport>Discord support server</linkSupport> to ask questions or raise concerns regarding Ticketer."
							}
						}
					},
					"discord-bot": {
						"title": "Discord Bot",
						"sections": {
							"1": {
								"title": "What do you mean by \"Discord Data?\"",
								"description": "From the old <linkDiscordPP>Discord Developer Privacy Policy</linkDiscordPP>:",
								"quote": "“Discord Data” means any and all data you obtain through the APIs."
							},
							"2": {
								"title": "What Discord Data do you store?",
								"paragraphs": {
									"1": {
										"text": "The Ticketer bot may store the following relevant data from Discord when prompted through an application command by a user:",
										"list": {
											"1": "Guild, Channel, Role, and User IDs",
											"2": "Message Content from Modals",
											"3": "Data Passed Through Command Options"
										}
									},
									"2": {
										"text": "In addition, Ticketer may store data not prompted through commands, such as:",
										"list": {
											"1": "Thread's State"
										}
									}
								}
							},
							"3": {
								"title": "Why do you need the data?",
								"description": "All of the data collected by Ticketer is necessary to keep the application running and functioning as expected."
							},
							"4": {
								"title": "How do you use the data?",
								"description": "The information is used to provide a quality user experience in a Discord server, such as creating support tickets, automatically sending a message on thread creation, or automatically creating a thread under a message."
							},
							"5": {
								"title": "How long is the data stored for?",
								"description": "The majority of the data is stored permanently. An exception is for thread tickets, where they automatically get deleted when the thread is deleted."
							},
							"6": {
								"title": "Do you share the Discord Data to companies or people?",
								"description": "No."
							},
							"7": {
								"title": "How can users contact you if they have concerns about your bot?",
								"description": "They may join the <linkSupport>official support server on Discord</linkSupport> or open an issue/discussion on the Ticketer GitHub page."
							},
							"8": {
								"title": "How can users have the data removed?",
								"description": "They may do the following above."
							}
						}
					}
				}
			},
			"terms-of-service": {
				"heading": {
					"title": "Ticketer Terms of Service",
					"description": "This page was last updated on {lastUpdated}."
				},
				"sections": {
					"who-can-use-the-service": {
						"title": "Who can use the service?",
						"description": "By using Ticketer, you are agreeing to both the privacy policy and terms of service. The terms of service may be changed at any moment without notice. You are also agreeing that you are over 13 years old, or above the minimum age to use Discord in your country, whichever is higher."
					},
					"content": {
						"title": "Content",
						"description": "You are responsible for the content created by you in any stored data on Ticketer. Ticketer does not filter, verify, nor condone the content created by users."
					},
					"termination": {
						"title": "Termination",
						"description": "Ticketer reserves the right to delete data and/or block Discord guilds (servers) without warning, especially if a server is found to be violating including but not limited to: laws and terms of services. The former action is irreversible."
					}
				}
			}
		}
	}
}
